#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.vpn-manage-internal.random_id.ipsec_secret: Refreshing state... [id=CX0omE50HUM]
module.test.google_compute_backend_service.internal-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service]
module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute]
module.test.data.google_compute_zones.available: Reading...
module.test.google_compute_instance.default: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute]
module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert: Refreshing state... [id=projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert]
module.test.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/cq-provider-gcp/global/networks/cq-compute-vpc]
module.test.google_compute_backend_service.another-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-another-backend-service]
module.test.google_compute_ssl_policy.ssl-policy: Refreshing state... [id=projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy]
module.test.google_compute_https_health_check.backend-service-health-check: Refreshing state... [id=projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check]
module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01]
module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute]
module.test.google_compute_backend_service.backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-backend-service]
module.test.google_compute_url_map.url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-urlmap]
module.test.google_compute_url_map.external_url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap]
module.test.google_compute_router.vpn_router: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router]
module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy: Refreshing state... [id=projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy]
module.test.data.google_compute_zones.available: Read complete after 1s [id=projects/cq-provider-gcp/regions/us-east1]
module.test.google_compute_instance_group.test: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500]
module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy]
module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy]
module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1]
module.test.module.vpn-manage-internal.google_compute_route.route[0]: Refreshing state... [id=projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0] has changed
  ~ resource "google_compute_vpn_tunnel" "tunnel-static" {
      ~ detailed_status                 = "Allocating resources. VPN tunnel will start soon." -> "No incoming packets from peer"
        id                              = "projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1"
        name                            = "cq-compute-tunnel-1"
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.test.google_compute_instance.default must be replaced
-/+ resource "google_compute_instance" "default" {
      ~ cpu_platform         = "Unknown CPU Platform" -> (known after apply)
      ~ current_status       = "TERMINATED" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> (known after apply)
      ~ instance_id          = "8718984455297358340" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "zuFR_-HDP94=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "cq-compute"
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> (known after apply)
        tags                 = [
            "health-check",
            "ssh",
        ]
      ~ tags_fingerprint     = "YE9oAcj-gRw=" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/disks/cq-compute" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20220519" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/default" -> "default"
          ~ network_ip         = "10.142.0.3" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "cq-provider-gcp" -> (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
          ~ preemptible         = true -> false # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*